{
  "narrative_layer": {
    "world_atmosphere": {
      "regions": {
        "Region_Zenith": {
          "display_name": "Area Z: ZENITH (中枢区)",
          "keywords": ["White", "Academic", "Clean", "Floating"],
          "prompt_snippet": "洛迪亚的人工中轴与行政极点。视野中多为以太风格的白色流线型高塔，这些建筑通过反重力基座悬浮在人工运河上方。路面铺设着整洁的白色石砖，植被修剪整齐。如果不算无人机的轻微嗡鸣声，这里通常比较安静。往来人群多为身穿制服的研究员或联盟官员。",
          "geography_desc": "Z区位于洛迪亚特区的正中央极点。该区域完全没有天然地形，四周被人工开凿的环形水系【零光护城河 (Zero Halo Moat)】与外界物理隔绝。整个区块只被唯一的人造生态【阿卡迪亚草坪 (Arcadia Lawns)】覆盖，在高度平整的合成草皮之上，精密分布着象征特区最高权力的全白色行政建筑群。",
          "center_point": [1, 1],
          "sub_nodes": {}
        },
        "Region_Neon": {
          "display_name": "Area N: NEON (霓虹区)",
          "keywords": ["Urban", "Digital", "Commercial", "Verticality"],
          "prompt_snippet": "全岛商业聚集地与现代都市区。建筑密集且通过多层高架光轨连接，拥有覆盖建筑表面的3D全息广告牌，主要光照来自城市本身的景观灯光。地面无论是步行道还是车道均为金属或合成材质。这里集纳了各种百货商店、游戏厅和电视台设施，环境音充满了各类电子设备的提示音。",
          "geography_desc": "N区位于特区的东南象限，地貌结构相对单纯且扁平。其主体80%的面积覆盖着【光辉平原 (Radiant Plains)】（及其之上的光辉市），这片低矮的现代草甸向西隔着【零光护城河 (Zero Halo Moat)】遥望Z区，向北则被人工开凿的笔直水道【铬色运河 (Chrome Canal)】截断，与S区的黑色荒原形成鲜明界线。整个特区的南部边缘，从B区的东界开始一直延伸至最东端，都被连贯的金色沙滩带【黄金地平线 (Golden Horizon)】包围，构成了没有复杂起伏的开放式海防线。",
          "center_point": [12, -12],
          "sub_nodes": {}
        },
        "Region_Bloom": {
          "display_name": "Area B: BLOOM (盛放区)",
          "keywords": ["Nature", "Humid", "Wooden", "Resort"],
          "prompt_snippet": "由蓝莓学园温控系统维持的亚热带度假区。即使在建筑稠密处也很容易看到巨大的热带植物叶片。房屋多建在离地的木质栈道上，下方连接着清澈的浅滩和流动的三角洲水系。空气湿度较高且常有暖风，这里的节奏较慢，主要设施包括种植园、露天疗养所和海滨浴场。",
          "geography_desc": "B区位于洛迪亚特区的西南象限，是由【翡翠脉络河 (Emerald Vein River)】和【镜面莲花湖 (Mirror Lotis Lake)】两大水系分割形成的典型亚热带三角洲地貌。其天然地理边界呈现为“西低北高”的态势：西侧全境几乎与海平面持平，拥有广阔的沙滩和湿地系统（包含蓝宝石海岸和淤积三角洲）；北部则地势骤升，被这片全岛最大的原始密林【翡翠天冠 (Jade Canopy)】所阻断，形成了天然的物种屏障。东侧则通过较为干燥的【微风林地 (Breeze Woodlands)】与城市地块缓冲接壤。核心城镇【珍珠镇 (Pearl Resort)】作为区域枢纽建立在最南端的入海口处，紧邻【向日花农场 (Sunflora Farmsteads)】的农业腹地。",
          "center_point": [-13, -13],
          "sub_nodes": {}
        },
        "Region_Shadow": {
          "display_name": "Area S: SHADOW (暗影区)",
          "keywords": ["Dense", "Chilly", "Alleys", "Residential"],
          "prompt_snippet": "位于东北象限的高密度旧生活区，整体气温维持在较低水平，能看见明显的呼气白雾。街道并不拥挤但较为狭窄，建筑多以深色的集装箱材质和红砖结构堆叠而成。光照以暖黄色的街灯为主，拥有大量未规划的小巷捷径。",
          "geography_desc": "以水银溪 (Mercury Stream) 为中轴线将区域一分为二，S区虽然位于东北方位，但呈现出阴湿、寒冷与旧时代氛围交织的面貌。东侧是作为现代聚居地的核心版块，坐落在暗黑色的【余烬荒原 (Cinder Moor)】之上，背靠着北方横跨该区域整个北境的极寒屏障【沉寂冻土 (Silent Tundra)】。而在河流的西侧，地形呈现多样的过渡态：以中部的【镇魂高地 (Spirit Plateau)】为节点，向南连接着鬼魅的【暮光灌丛 (Twilight Copse)】和有着独特酸性红泥的【深红泥炭地 (Crimson Peat)】，向北则是一片甚至不随季节变化的金色【银杏之森 (Ginkgo Grove)】，将冻土与荒原分割开来。",
          "center_point": [12, 12],
          "sub_nodes": {}
        },
        "Region_Apex": {
          "display_name": "Area A: APEX (极诣区)",
          "keywords": ["Rugged", "Red_Soil", "Dry", "Industrial"],
          "prompt_snippet": "保留了大量裸露红土与岩石地貌的开阔地带，干燥且日照强烈。原本的也是重工业设施并没有完全覆盖地面，而是有着大片的训练空地和起伏的岩山。视野开阔，能直接看到远处的矿山挖掘机械和运输飞机的起降。这里没有多余的装饰，设施都呈现出硬朗的金属质感。",
          "geography_desc": "A区是一个充满极端高差与剧烈地貌变换的崎岖之地。核心地标是一座仍在活动的巨型火山【炼狱火山口 (Inferno Crater)】耸立于西方，其熔岩流向西冷却形成了【黑曜石滩 (Obsidian Beach)】，向东则堆积成了富含金属矿藏、也是A区面积最大的【深红恶地 (Crimson Badlands)】。在最南端，通过干燥的【野蛮荒地 (Savanna Outlands)】与B区接壤；而往北因为海拔陡升，地貌在火山口边缘突变为被冰雪覆盖的【霜咬坡地 (Frostbite Slope)】，并与S区东部的广阔冻土相连。整个区域被大片的内陆中心沙漠【焦痕沙丘 (Scorched Dunes)】连接起来，是全岛虽不适宜居住但自然能量最活跃的区域。",
          "center_point": [-13, 13],
          "sub_nodes": {}
        }
      }
    }
  },
  "region_zones": {
    "Aether_Admin_Zone": {
      "exterior_view": "这是Z区最高的建筑群，由核心主塔和四座副塔围合而成，从远处看像是一簇巨大的白色圆柱体插入云层。所有的外墙都覆盖着平滑反光的陶瓷材料，没有任何棱角，底部围着一圈带有六角形光闸的宽阔围墙。",
      "internal_reality": "这里是AZC联合议会的集中办公地，内部空间非常巨大，甚至允许飞行出租车直接停靠在低空层平台。大厅内非常空旷，接待前台都在很远的位置。比起人，这里更容易见到巡逻的无人机和自助终端机，主要处理最高级别的行政工作。",
      "center_point": [1, -5],
      "sub_nodes": {}
    },
    "Royal_Academy": {
      "exterior_view": "这占地面积最大的一片低密度建筑群。外层包裹着大量透明的玻璃幕墙，从高处俯瞰呈现出同心圆的结构。最显眼的是建筑群中央夹着几个露天的标准尺寸宝可梦对战场地，周围环绕着看台。",
      "internal_reality": "这是一所不仅包含教学楼，还囊括了一座图书馆和室内体育馆的综合校区。内部通过多层走廊连接，墙挂着历代联盟冠军的照片。平时这里充满了身穿特区制服的学生和教职人员，到处都是讨论战术的声音。",
      "center_point": [-2, 4],
      "sub_nodes": {}
    },
    "Living_Quarter": {
      "exterior_view": "位于侧翼也是最密集的一片街区。由数十栋外观完全相同的白色方块状高楼整齐排列组成。楼与楼之间的间距完全相等，地面看不到任何垃圾桶或电线杆，植被也被修剪成了统一的球形。",
      "internal_reality": "特区管理层专用的生活社区。街道上铺设了吸音材料，脚步声很轻。每栋楼底层都配有自动便利店和公共大堂，虽然住着很多人，但除了必要的刷卡声外，很少有邻里间的喧哗声。",
      "center_point": [5, 4],
      "sub_nodes": {}
    },
    "Lusamine_Gardens": {
      "exterior_view": "行政区后方的一一大片平整绿地。我不像一般的公园那么甚至随意，这里的每一条路都是笔直或者正圆的几何图案，白色的石头步道将土地分割成整齐的方块。中央设有着大型的景观喷泉阵列。",
      "internal_reality": "这是一座通过生物技术维护的人工植物园，里面种的都是珍稀的观赏花卉，看不到杂草。里面虽然有花香，但并没有野生森林那种泥土味。主要用于官方举办露天茶会，或者供行政人员也就是散步，路很好走，不会弄脏鞋子。",
      "center_point": [5, -3],
      "sub_nodes": {}
    },
    "Eco_Subject_Delta": {
      "exterior_view": "被一个半透明的巨型半球形力场护盾完全扣在地面上的独立区域。从外面看不清具体细节，只能隐约看到内部主要有着不同颜色的地貌，周围插慢了闪着红光的警示信标和监控探头。",
      "internal_reality": "内部是一个模拟极端天气的封闭测试场，温度和湿度由巨大的换气扇强制调节。地面上插满了数据采集器。这里不是也就是用来参观等，主要是科研人员用来投放并观察宝可梦适应性数据的地方，背景里一直有机器的运转声。",
      "center_point": [-4, -2],
      "sub_nodes": {}
    },
    "Academic_Plaza": {
      "exterior_view": "连接学校、公寓和办公区的一个巨型十字路口和集散广场。地面铺着带有动态光标指示宽阔的浅蓝地砖。最明显的标志是广场上空悬浮着的多面体全息投影，循环播放着时间和公告。",
      "internal_reality": "这里是整个Z区人流集散的公共休息区。周围沿着花坛摆放着大量长排白色座椅，安装了充足的照明路灯。不仅是学生放学，还是职员下班，这里都是碰头、等人或者甚至暂时，坐下来休息的主要地段。",
      "center_point": [1, -1],
      "sub_nodes": {}
    },
    "Iono_Stream_Tower": {
      "exterior_view": "坐落在辉光市正中心的地标性建筑，也是全城的制高点。这是一座巨大的倒金字塔形广播塔，顶部那标志性的小磁怪造型天线在城市的任何角落抬头都能看见。塔身不仅仅是建筑表面，更加装了覆盖辉光市最大的户外LED显示屏，全天播放着节目与城市公告。",
      "internal_reality": "这里是辉光市电视台与网络数据的处理中枢。内部并没有神秘机关，就是标准的现代化演播大楼。走廊宽敞明亮，挂着今日节目的流程表和嘉宾照片。由于是奇树（Iono）的办公地，大厅里经常有拿着周边产品的粉丝在排队参观，氛围很轻快，像个热闹的旅游景点。",
      "center_point": [14, -12],
      "sub_nodes": {}
    },
    "Toxic_Industrial_Park": {
      "exterior_view": "位于辉光市西北边缘的一大片功能性厂区，负责供应全城的电力和处理生活垃圾。巨大的黄色排烟管和紫色的储液罐虽然很高，但并没有乱排乱放，看起来井然有序。为了不影响市容，外围种了一圈抗污染的绿化带，将工厂区与市中心隔绝开来。",
      "internal_reality": "这里是各种自动化流水线车间。巨大的机械臂在对不可回收垃圾进行压缩打包，空气中混杂着消毒水和机油的味道。和市中心的精致不同，地面是防滑钢板。经常能看到工人们带着为了以防万一的防毒面具，指挥臭臭泥和双弹瓦斯进行废物降解。",
      "center_point": [18, -4],
      "sub_nodes": {}
    },
    "Cyber_Shopping_District": {
      "exterior_view": "辉光市的核心商业圈。由好几座大型百货公司通过二楼和三楼的空中连廊连接而成，下面是车流，上面是人流。为了突出辉光市的“光”主题，每栋楼的幕墙在白天反射阳光，晚上则全部亮起动态灯关，不管几点来都像白天一样亮堂。",
      "internal_reality": "标准的现代化购物中心内部，有着辉光市最密集的精灵球商店、时装店和连锁餐厅。冷气开得很足，扶梯和观光电梯上总是挤满了人。到处都贴着“年中大促”或“买一送一”的广告，充满了商场特有的那种背景音乐和促销广播声。",
      "center_point": [8, -12],
      "sub_nodes": {}
    },
    "Port_Logistics_Area": {
      "exterior_view": "辉光市面向深海一侧的大型物流港口。这里没有观光客，只有一排排像大楼一样高的彩色集装箱堆场。可以看到巨大的龙门方吊正在往货轮上装卸物资。地面全部硬化，为了方便重型卡车行驶，画满了黄色的交通和区域作业引导线。",
      "internal_reality": "巨大的半开放式仓储棚。这里是辉光市不仅也是通往外界的物资吞吐口，里面堆满了发往全岛各地的箱子。海风很大也很腥，工人们都穿着统一的反光背心。除了货物碰撞的声音和检货员的哨子声，这里没有那些花哨的装饰，是非常务实的工作区域。",
      "center_point": [21, -8],
      "sub_nodes": {}
    },
    "Glitch_Arcade_Lane": {
      "exterior_view": "隐藏在辉光市高楼缝隙里的一条步行后街。由于市政规划没能在老城区完全推行，这边的建筑看起来比大街上旧很多。狭窄的街道两侧招牌林立，电缆线拉得比较低。这里是辉光市年轻人放学后也就是爱钻的地方，门口停满了自行车。",
      "internal_reality": "整条街都是连排的游戏厅和卡拉OK。虽然店铺空间局促，但密度非常高。室内光线不强，全靠不仅是最新型的VR游戏舱，也有老式格斗游戏机屏幕发出的五颜六色的光照亮。环境很吵闹，主要是各种游戏音效和玩家赢了之后的欢呼声。",
      "center_point": [12, -6],
      "sub_nodes": {}
    },
    "Skyline_Residences": {
      "exterior_view": "辉光市南部普通市民的集中居住区和标准化的高层住宅群。几十栋外观一样的白色高楼整齐排列。为了节省用地，楼间距不大，但是每户的窗户都朝向好光线。阳台上挂着衣服、空调外机，甚至还能看到有人养着向日花怪，是这座灯光都市里最有生活气息的地方。",
      "internal_reality": "公寓内部走廊铺着降噪地毯，很安静。每层固定位置都有垃圾分类口和包裹寄存柜。大楼入口有自动识别门禁，只有卡车大小的搬运机或者快递洛托姆进进出出。对于辉光市的上班也来说，这里就是一个睡觉和休息的标准单元。",
      "center_point": [6, -18],
      "sub_nodes": {}
    },
    "Synth_Promenade": {
      "exterior_view": "一条为了缓解辉光市钢筋水泥压迫感而特意修建的带状公园。顺着人工景观河从商圈一直延伸到居住区。路边种的树虽然有些是耐旱品种，但修整得很好看。人行道地砖到了晚上会微微发光，既是装饰也是路灯功能。",
      "internal_reality": "辉光市为数不多可以惬意散步的地方。不像野外路面高低不平，这里地面非常平整，甚至适合溜旱冰。路边的长椅大多带有给手机充电的USB接口。经常能看到学生坐在这里吃冰淇淋，或者宝可梦训练家在这里整理这背包清理道具。",
      "center_point": [20, -21],
      "sub_nodes": {}
    },
    "Pearl_Resort": {
      "exterior_view": "B区最南端的主要滨海城镇，坐落于蓝宝石海岸 (Sapphire Strand)之上，沿海岸线呈带状分布的开放式生活小镇。建筑普遍低矮，外墙刷成白色，屋顶则是色彩柔和的瓦片。城镇被大量的棕榈树和绿化带包裹，南面没有任何阻挡，直通海滩。",
      "internal_reality": "这里不仅有高端酒店，也有普通民居和繁华的商业主街。街道铺着防滑的浅色石砖，不仅有拿着板冲浪的游客来回穿梭，本地居民也在街边经营店铺。没有任何工业噪音，空气流通性极佳，是一个兼具旅游服务与日常生活功能的成熟社区。",
      "center_point": [-19, 18],
      "sub_nodes": {}
    },
    "Sunflora_Farmsteads": {
      "exterior_view": "紧贴在珍珠镇北侧、直接与之接壤的大片农业平原。从镇上看过去，视线会被巨大的风力发电机和整齐的玻璃温室阵列占据。这片区域没有高大的树木遮挡，不仅拥有最充足的日照，田间还有大量甚至难以分不清是植物还是向日花怪的黄绿色斑块。",
      "internal_reality": "这里是珍珠镇的物资大后方和观光农场。比起南部这里多了泥土和肥料的味道。不仅有自动化的灌溉系统，也经常能看到豪力或其它格斗系宝可梦在协助搬运成箱的树果。虽然是农业区，但道路修缮得很好，经常有从镇上过来的游客进行采购采摘。",
      "center_point": [-15, 14],
      "sub_nodes": {}
    },
    "Marina_Port_Town": {
      "exterior_view": "位于B区东侧深处、被高大的微风林地（Breeze Woodlands）像墙壁一样四面包围的隐蔽据点。虽然不靠海，但依托森林内部丰富的内陆河网建立。建筑风格以深色的防水木屋为主，像是漂浮在绿色林海中的孤岛镇子。",
      "internal_reality": "这里的氛围不仅比海岸更从容，也更阴凉。除了中心的小型内河码头外，主要是由防腐木栈道连接的店铺。由于植被太茂密，空气湿度很大且充满苔藓和草药味。这里不再是喧闹的旅游团聚集地，更多是作为探索森林深处的补给站或护林员的聚点。",
      "center_point": [-4, -12],
      "sub_nodes": {}
    },
    "Grim_Borough": {
      "exterior_view": "铁灰市（Iron-Soot City）的主城区和居住生活带，坐落于余烬荒原上。这片区域的建筑非常密集，主要是由暗红色的砖块和漆成黑色的耐腐蚀金属板搭建成的旧式楼房。街道不像霓虹区那么宽阔，有很多为了在那寒风中保温而设计的狭窄回廊或拱门。",
      "internal_reality": "这是铁灰市人口最集中的地方，也是玛俐的根据地。街道两旁并没有高级商场，而是大量闪着暖黄色灯笼的拉面店、露天小酒馆和杂货铺。墙壁上有不少甚至可以说是艺术品的涂鸦。这里虽然不像中心区那样整洁，道路有时也高低不平。",
      "center_point": [16, 7],
      "sub_nodes": {}
    },
    "Venom_Refinery": {
      "exterior_view": "位于铁灰市边缘的工业处理设施。标志性的外观是几座如同倒扣巨碗的密封车间，周围环绕着复杂的冷却管道。不同于霓虹区的清洁能源，这里主要处理的是有机化学品。烟囱排出的气体通常是紫灰色，在黑夜里并不明显，但总能闻到一股明显的化学酸味。",
      "internal_reality": "这是一个正规运作的能源提炼厂。内部有着巨大的沉淀池和反应釜，光线比较昏暗。工作人员通常穿着厚重的防护服。这里并不全靠机器，大量像是臭臭泥和瓦斯弹这样的毒系或钢系宝可梦负责吞噬和分解有害物质。虽然看起来危险，但地面有明显的黄色安全警戒线。",
      "center_point": [19, 3],
      "sub_nodes": {}
    },
    "Frost_Smoke_City": {
      "exterior_view": "深入北方永冻苔原（Silent Tundra）的小型定居点。城市规模不大，房屋大部分一半埋在地下或利用了加厚的球形穹顶来抵御暴雪。城市四周有明显的热蒸汽喷口，白色的雾气笼罩着深灰色的石质建筑，让这里在雪原中很难被一眼看穿。",
      "internal_reality": "整个城市的运作都围绕着地热系统。路面上铺着融雪热管，所以并没有积雪。这里不仅没有嘈杂的车流，人口密度也很低，路上行人大多穿着厚重的棉衣行色匆匆。这里没有太多娱乐设施，主要的公共场所是大浴室和也是为各个探险队提供热食的补给站。",
      "center_point": [10, 16],
      "sub_nodes": {}
    },
    "Requiem_Grounds": {
      "exterior_view": "位于霜烟市西北郊更荒凉的山坡上。这是一片用来纪念已故宝可梦的墓地塔群。并没有阴森的大门，只是散落着许多形状各异、刻着名字的深色石碑和几座日式风格的石塔。周围没有路灯，晚上的光源主要来自幽灵系宝可梦不仅自身发出的，还有供奉用的鬼火。",
      "internal_reality": "虽然是墓地，但经常有人拿着花束来扫墓或静坐回顾，地面打扫得很干净。这里非常安静，脚步声会被积雪吸收。阿塞萝拉有时会这里维护秩序。比起恐怖，这里给人的感觉更像是一个安静严肃的缅怀公园，偶尔能看到耿鬼在石塔后方捉迷藏。",
      "center_point": [9, 20],
      "sub_nodes": {}
    },
    "Canal_Ruins_Post": {
      "exterior_view": "位于霜烟市正北方，沿着已经冻结的古代大运河遗址设立的前哨站。主体是一座为了在此地进行进行考古挖掘和水文监测而不仅加固过，甚至看起来像是利用了部分遗迹墙壁修建的观测站。周围有一些依然耸立的古代石柱和断桥。",
      "internal_reality": "一个简陋但坚固的单层据点。屋内为了长时间值守所以暖气开得很足，甚至有些闷热。里面摆满了地形图纸、通信器材和考古发掘出的碎片。这里主要是给去北方极地考察的巡护员（Ranger）歇脚的地方，不提供一般游客服务。",
      "center_point": [14, 18],
      "sub_nodes": {}
    },
    "Kamunagi_Hollow": {
      "exterior_view": "也就是位于S区与A区交界处的天然凹地，充当自然形成的庇护所。它的位置很特殊：北面可以望见金色的银杏林（Ginkgo Grove），南面则连接着深红泥炭地（Crimson Peat）。居民利用自然地形的落差建造了许多像半地穴一样的半木半石小屋，屋顶通常长满了苔藓。",
      "internal_reality": "这是一个有点像可以被称为古代村落的地方，不属于任何城市管辖。生活在这里的大多是对R手环和现代科技“过敏”的人（如来自古代的特殊居民）。既没有自动门也没有全息屏，照明靠火把和电灯怪。虽然原始，但房屋结构很结实，能有效阻挡荒原的风沙，很有露营的安全感。",
      "center_point": [2, 15],
      "sub_nodes": {}
    },
    "Crimson_Forge_City": {
      "exterior_view": "坐落在深红色火山口下的A区核心工业都城，全城被巨大的传送带和管道纵横穿插。建筑风格非常粗暴，多数房屋由耐火砖和漆黑的金属框架构成，外墙常年被火山灰和矿粉染上一层暗红色。城市的边缘有巨大的风路系统在不断抽排来自泰坦矿坑的热气。",
      "internal_reality": "这里是一座几乎可以说建立在轮子上的城市。街道非常宽阔，能并行两辆重型矿车，地面上有明显的履带压痕。比起商场，街道两旁更是各类机械修理店、甚至是能给大岩蛇抛光的洗护店。噪音很大，包含金属冲击声和引擎轰鸣声，居民说话嗓门普遍很大，生活节奏快而硬朗。",
      "center_point": [-7, 14],
      "sub_nodes": {}
    },
    "Titan_Mining_site": {
      "exterior_view": "直接隶属于红莲锻造市的巨型露天矿坑复合体，从城市一侧延伸出的巨大阶梯状挖掘坑。视线所及全是工程器械：几十层楼高的斗轮挖掘机、悬挂在空中的矿石缆车索道。在夜间，探照灯把这里照得像白天一样，扬起的尘土在强光下如同黄色的雾气。",
      "internal_reality": "这是一个不仅繁忙，而且完全没有绿化，只有乱石、钻头和脚手架的纯生产现场。地面震动频繁，并不是地震，而是钻孔作业。这里很少见到闲人，只有戴着安全帽的工人和拥有怪力的格斗系或岩石系宝可梦在配合劳作，空气干燥且有金属的土腥味。",
      "center_point": [-12, 17],
      "sub_nodes": {}
    },
    "Dune_Watcher_Post": {
      "exterior_view": "孤悬在广阔的赤热沙丘（Scorched Dunes）沙漠腹地，被沙暴阻隔的中途休息镇。为了防止流沙侵袭，整个镇子建立在几块凸起的巨大耐风化岩盘之上。建筑低矮，全是厚实的土黄色抗风墙，有些房屋甚至直接就是用退役的集装箱货列改装并固定的。",
      "internal_reality": "这是穿越沙漠旅行者唯一的“绿洲”。虽然没有高档享受，但这里有一个巨大的公共蓄水站和带遮阳棚的市集。街道上挂着防风沙的厚布帘，到处都能看到旅行者在给沙漠蜻蜓喂食或者清理护目镜。尽管环境恶劣，但这里有冰饮店、简陋的旅社和精灵中心，显得异常热闹。",
      "center_point": [-12, 6],
      "sub_nodes": {}
    },
    "Ruins_of_Giants": {
      "exterior_view": "位于火山口东部断崖下的深谷之中。从上面俯瞰，能看到地面有非自然形成的巨大刻痕和排列奇怪的巨石阵列。其中最醒目是几座早已倒塌甚至只剩半截的古代石柱，上面刻满了不明意义的几何图案，部分石块甚至比旁边的采矿工棚还要大。",
      "internal_reality": "这里即使在大白天也会被山谷和烟尘遮挡阳光，显得有些压抑。周围已经拉起了禁止施工的警戒线。现场不仅散落着考古器械，也经常有像是这里本来就有的念力土偶或象征鸟在石柱上栖息。这里没有现代建筑，只有几顶为了不破坏现场而临时搭建的探测帐篷和简单的照明设备。",
      "center_point": [-19, 12],
      "sub_nodes": {}
    }
  },
  "biome_flavor": {
    "Arcadia_Lawns": {
      "visual_texture": "这是被精心规划过的完美人工平地。地面覆盖着如毯子般浓密且颜色均一的合成绿草，没有任何野草或裸露的泥土斑秃。散落的白桦树木被等距栽种，树冠呈现标准的几何形状。远处能看到如同镜子般环绕外围的“零光护城河（Zero Halo Moat）”映衬着洁白的建筑倒影。",
      "sensory_feed": "气温恒定在最舒适的24度，湿度亦被精准控制。这里没有风沙眯眼的困扰，只有人工调节的微风。空气里弥漫着类似新修剪草坪的清香与很淡的臭氧味。非常安静，没有野外的鸟叫蝉鸣，脚步踩在草坪上只有轻微的沙沙声。",
      "center_point": [1, -1],
      "sub_nodes": {}
    },
    "Sapphire_Strand": {
      "visual_texture": "位于B区西南角的蓝宝石海岸 (Sapphire Strand)。沙质极其细腻洁白，在阳光下甚至有些刺眼。浅海处能看到清澈见底的渐变蓝色水体。向北与翡翠色的大地接壤，东侧与河口湿地隔水相望。沿岸稀疏分布着可以遮阳的椰树。",
      "sensory_feed": "海浪有节奏的拍岸声是这里的主基调，间或夹杂着长翅鸥的叫声。阳光照射强烈，脚踩在沙滩上会感到明显的热度。海风带有咸湿的味道，但并没有鱼腥味，更多是一股通透的热带气息。",
      "center_point": [-21, -22],
      "sub_nodes": {}
    },
    "Hermit_Sands": {
      "visual_texture": "连接着南部蓝宝石海岸与北部的隐士沙洲 (Hermit Sands)。这一条较窄的过渡沙带，沙土颜色较深，夹杂着碎贝壳和干枯的灌木丛。地形不太平整，有一些隆起的小土包或被巨翅飞鱼冲刷出的痕迹。",
      "sensory_feed": "比起柔软的观光沙滩，这里走起来更费力，能感觉到沙粒有些硌脚。偶尔能发现石居蟹或壶壶藏在沙下的动静。因为靠近内陆，风中除了海味还混杂着北面干燥草原吹来的尘土味。",
      "center_point": [-22, -5],
      "sub_nodes": {}
    },
    "Aroma_Meadow": {
      "visual_texture": "位于海岸线北部的大片开阔芳香草甸 (Aroma Meadow)。色彩非常鲜艳，根据季节地块种植着大片的花海，通常是粉色和紫色为主。田块之间只有为了方便采摘留出的狭窄土路，视野非常开阔，没有高大的树木遮挡。",
      "sensory_feed": "尚未靠近就能闻到极其浓郁甚至有些冲鼻的花蜜甜味。空气中有明显飘浮的花粉微粒。不论何时都能听到三蜜蜂震动翅膀的虫鸣声。不仅视觉上，触觉上充满了柔软的花瓣摩擦感。",
      "center_point": [-15, -16],
      "sub_nodes": {}
    },
    "Jade_Canopy": {
      "visual_texture": "这片全岛最大的翡翠天冠 (Jade Canopy) 原始丛林，像一面绿色的墙壁挡在北面。树木异常高大，树冠连接在一起遮蔽了大部分天空，导致底层的光线总是阴暗的绿色调。没有整齐的路，植被密度极高，全是纠缠的藤蔓和气根。",
      "sensory_feed": "一进入林子光线会骤暗，气温变得闷热潮湿，仿佛空气是不流动的。地面由厚厚的落叶层构成，踩上去如果冻般陷落感觉。非常嘈杂，充满了野生鸟类的叫声，以及头顶上方宝可梦快速跳跃造成树枝剧烈晃动声。",
      "center_point": [-15, -4],
      "sub_nodes": {}
    },
    "Deep_Root_Hollow": {
      "visual_texture": "隐藏在森林最深处、已近地下的深根空洞 (Deep Root Hollow)。这里完全看不到天空，四周墙壁是缠绕了几百年的巨型棕褐色树根，地面覆盖着厚得夸张的苔藓。唯一的光源是发出微弱蓝光的巨型真菌。",
      "sensory_feed": "异常阴冷，与外面的闷热形成鲜明对比。所有的声音在这里都会产生奇怪的回音。空气中有一股甜腥的腐烂植物根茎味道。安静得可怕，只有远处偶尔传来水滴的声音，或者有东西在暗处爬过树皮的摩擦声。",
      "center_point": [-11, -10],
      "sub_nodes": {}
    },
    "Silt_Delta": {
      "visual_texture": "位于河流东岸的一片淤积三角洲 (Silt Delta)。水流在这里变缓，形成了大量浅滩、泥沼和如果冻般的黑土地。植物以大丛的芦苇和杂乱的水草为主，地面非常泥泞，有些地方甚至深得足以让人陷进去。",
      "sensory_feed": "空气粘稠潮湿，带有一股淤泥和水藻的特殊气味。即使是晴天也能感觉到灰蒙蒙的水汽感。耳边一直有青蛙的叫声和泥浆翻泡的咕嘟声。在这里行走需要时刻用力把腿拔出来，体感比较粘腻费力。",
      "center_point": [-11, -19],
      "sub_nodes": {}
    },
    "Breeze_Woodlands": {
      "visual_texture": "位于B区东部的开阔微风林地 (Breeze Woodlands)。这里的树木间距适中，阳光可以洒在布满野草的地面上。树种多为又轻又高的阔叶乔木，树叶颜色偏浅绿和嫩黄，整体色调明快清爽。",
      "sensory_feed": "与西面闷热的林子不同，这里以通风良好著称，总是有凉爽的穿堂风吹过。能够清晰地听到树叶摩擦的沙沙声。空气清新，有淡淡的草木清香。这是令人放松的郊游环境，不像幽暗密林那样有压迫感。",
      "center_point": [-6, -15],
      "sub_nodes": {}
    },
    "Golden_Horizon": {
      "visual_texture": "这是甚至比B区的沙滩更加宽阔、绵延整个N区南岸的黄金地平线 (Golden Horizon)。沙质呈现深金黄色，颗粒比白沙滩稍粗，混杂着许多亮晶晶的矿物颗粒，在阳光下会像金子一样反光。这里视野极其开阔，也是海岸线最平直的一段。",
      "sensory_feed": "由于经常有人工快艇和水上电车经过，背景音除了海浪还要加上现代机械的嗡嗡声。没有植物遮挡，海风非常猛烈，甚至吹得人有点站不稳。沙子长期暴晒，温度很高，光脚踩上去有明显烫感。",
      "center_point": [9, -22],
      "sub_nodes": {}
    },
    "Radiant_Plains": {
      "visual_texture": "占据了N区绝大部分土地、甚至可以说包围着城市的光辉平原 (Radiant Plains)。这不是野生的荒草地，而是植被低矮、似乎带有荧光特质的现代草甸。远方能清晰看到浮空的Z区建筑，近处则与北方深色的余烬荒原隔运河向望，形成了极强的黑亮反差。",
      "sensory_feed": "这里风势也很大且毫无遮挡。不知道是静电还是特殊草种的原因，空气干燥到让人头发都会竖起来，皮肤会有轻微的酥麻感。不时能听到变压器般的“噼啪”声。这里没有昆虫的鸣叫，取而代之的是电流流过的静谧低频声。",
      "center_point": [10, -13],
      "sub_nodes": {}
    },
    "Savanna_Outlands": {
      "visual_texture": "位于A区南端与B区北境交织的广阔过渡地带。地貌呈现出令人赞叹的渐变色：南侧紧邻雨林处是即使旱季仍保持葱郁的温带草甸与灌木丛；越往北走，植被逐渐转化为金黄色的高草与红褐色土层，标志性的巨型金合欢树（Acacia）零星点缀在地平线上，构成了经典的稀树草原景观。这里不再是荒凉的无人区，而是成群迁徙吃草宝可梦的必经之路。",
      "sensory_feed": "比起北面焦灼的恶地，这里的气温恰到好处，只有持续不断的、干燥而温暖的信风吹拂。空气中弥漫着被阳光暴晒后的干草香气和这种来自泥土的温暖味道。耳边充斥着草叶互相摩擦的“沙沙”白噪音，以及远处肯泰罗或斑斑马群奔跑时的低沉蹄声。这是一种充满野性活力的宏大寂静。",
      "center_point": [-15, 2],
      "sub_nodes": {}
    },
    "Scorched_Dunes": {
      "visual_texture": "占据A区南部内陆腹地的焦痕沙丘 (Scorched Dunes)。这里的沙子并不像海滩那样金光闪闪，而是因混入了微量的火山灰与富铁矿物，呈现出仿佛被烘烤过的深红色泽。视野极其开阔，不仅有顺着风向延伸的层层沙脊，偶尔还能看到顽强生长的球形仙人掌或暴露的风化岩盘。这是一片纯粹、原始且寂静得令人敬畏的旱海。",
      "sensory_feed": "典型的高温干旱环境，空气极其干燥，几乎闻不到任何味道，但每次呼吸都会感到嗓子发紧。午后的能见度会受到地面升腾的热浪干扰，远处的景物看来都在微微扭曲晃动。耳边只有风吹过沙丘棱线时的呼呼声，脚感松软且带有明显的热度，在这里徒步是对耐力的极大考验。",
      "center_point": [-15, 7],
      "sub_nodes": {}
    },
    "Obsidian_Beach": {
      "visual_texture": "位于火山口西侧入海口的黑曜石滩 (Obsidian Beach)。不是细腻的沙滩，而是大片被海水冷却后的黑色破碎熔岩石。黑色的石头在阳光下闪着锐利的光，和白色的浪花形成强烈的黑白对比。",
      "sensory_feed": "没有普通海滩的休闲感。石头棱角锋利，甚至会割破鞋底。海水因为流经火山底层，虽然是海边水温却很高，甚至会冒着热气。能闻到并不好闻的硫磺味。海浪拍打石头的声音沉闷有力，像是重锤可以敲击。",
      "center_point": [-22, 14],
      "sub_nodes": {}
    },
    "Inferno_Crater": {
      "visual_texture": "A区的地理制高点炼狱火山口 (Inferno Crater)，一座虽然被挖空一半但依然活跃的活火山。山体呈现黑红色，只有山顶还在冒着滚滚浓烟。不仅地表到处是龟裂的纹路，在裂缝深处还能直接看到暗流动红光。",
      "sensory_feed": "这里就像是一个巨大的露天火炉。空气因为高热而极度缺氧，甚至呼吸都有些困难。地面是烫的，如果不时刻移动，鞋底可能会融化。耳边始终充斥着地下低沉像是大地心跳般的隆隆声和蒸汽的尖啸声。",
      "center_point": [-16, 14],
      "sub_nodes": {}
    },
    "Crimson_Badlands": {
      "visual_texture": "位于火山以东、最为广阔的深红恶地 (Crimson Badlands)。这是一片被铁锈色岩石覆盖的硬质荒原。经过长期的风蚀和工业开采，形成了大量如同迷宫般的红土石林和断层峡谷。几乎看不到绿色植物。",
      "sensory_feed": "视野非常开阔但并不令人舒适，红色给视觉带来很大的压力。充满了金属铁锈的味道。即便是没有工厂的地方，也能听到风穿过峡谷时发出的像鬼哭一样的呼啸声。地面异常坚硬，踩上去咔咔作响，是这里独特的节奏。",
      "center_point": [-4, 14],
      "sub_nodes": {}
    },
    "Frostbite_Slope": {
      "visual_texture": "火山北坡突然转换地貌的霜咬坡地 (Frostbite Slope)。因为高海拔和背风的原因，甚至红色还未褪去的岩石上突然覆盖了一层淡蓝透明的薄冰。植被从没有突然变成了被冻结的针刺灌木，呈现出奇怪的红白杂色。",
      "sensory_feed": "所谓的冰火两重天。明明脚下的岩石还有余温，甚至蒸汽还在冒，但扑面的风却冷得刺骨。这种极端的温差会让这里的石头变得非常脆，随时都可能听到岩石无预兆崩裂的脆响声。",
      "center_point": [-15, 21],
      "sub_nodes": {}
    },
    "Cinder_Moor": {
      "visual_texture": "位于S区东南部、甚至作为该区地基的余烬荒原 (Cinder Moor)。土地是暗灰黑色的，就像是大火烧过后的余灰压实了一样。没有高耸的岩石，地面相对平坦但有不少裂隙，从中渗出紫色的化学蒸汽。植被很少，只有些枯黄的硬草。",
      "sensory_feed": "并不算寒冷，甚至有点闷热。空气质量很差，混杂着燃油和工业废气的味道。在安静时能听到地底深处甚至可能是城市下水道传来的回声，让人总是神经紧绷。",
      "center_point": [18, 11],
      "sub_nodes": {}
    },
    "Twilight_Copse": {
      "visual_texture": "S区东南一角的暮光灌丛 (Twilight Copse)。这是真正的昏暗森林，树木不高但扭曲成怪异的形状，树皮发黑。不论白天黑夜，这里似乎永远笼罩在一层薄薄的紫雾中，发光的蘑菇遍地都是。",
      "sensory_feed": "死一样的寂静，连虫鸣声都没有，偶尔有乌鸦嘶哑地叫两声更显恐怖。空气明显比外界低几度，总有人觉得背后有视线在看着自己。脚下的枯枝被踩断的声音在这里会显得异常刺耳。",
      "center_point": [6, 10],
      "sub_nodes": {}
    },
    "Crimson_Peat": {
      "visual_texture": "深红泥炭地 (Crimson Peat)，一片看起来虽然也是湿地但和B区完全不同的红色沼泽。与其说是泥土，不如说是由万年来深红色的腐殖质堆积而成。水坑呈现像铁锈一样的红色。这里有不少保存完好的古代木桩。",
      "sensory_feed": "气味非常刺鼻，是一种独特的酸性泥土味。地面极为松软，但不是那种陷入的松软，而是带有弹性的海绵感。这里的雾气很浓，而且有种时间仿佛在这里被冻结了的静止感。",
      "center_point": [2, 12],
      "sub_nodes": {}
    },
    "Spirit_Plateau": {
      "visual_texture": "虽然名为镇魂高地 (Spirit Plateau)，其实并没有想象中阴森。这是一片覆盖着紫色石楠花和灰色碎石的开阔台地。由于周围的森林阻挡了视线，这里有一种被隔离的静谧感。偶尔能见到不知何人立下的石质神龛。",
      "sensory_feed": "风声很大，没有任何遮挡地穿过台地。比起下方城市的嘈杂，这里显得异常肃穆。即便没有幽灵系宝可梦出现，也会让人忍不住放低声音说话。空气干燥清冷，能让人头脑甚至不情愿地被物理降温。",
      "center_point": [4, 15],
      "sub_nodes": {}
    },
    "Ginkgo_Grove": {
      "visual_texture": "极具古代风格的银杏之森 (Ginkgo Grove)。即使是在其他地方是夏天，这里也始终像深秋一样铺满了金黄色的落叶。巨大的古银杏树排列成天然的阵列，阳光穿透不多的金色树叶洒下来，和周围黑色的环境形成极大的美学对比。",
      "sensory_feed": "非常安详的地方。能听到轻微的风铃声（可能是古人或宝可梦挂上去的）。空气清新，带着特有的银杏果气味（甚至有点微臭）。走在厚厚的落叶堆上，沙沙作响的声音让人感到宁静而非恐惧。",
      "center_point": [2, 18],
      "sub_nodes": {}
    },
    "Silent_Tundra": {
      "visual_texture": "横跨整个S区最北界的沉寂冻土 (Silent Tundra)。视线所及只有单调的白和灰。所有的植物低矮且紧贴地面，岩石都被厚厚的积雪覆盖，棱角变得圆润模糊。除了几个黑色的蒸汽喷口外，这里是一片纯粹白色的虚无世界。",
      "sensory_feed": "这里的寒冷是物理性质的疼痛，呼吸出的白汽甚至会在睫毛上结霜。名字并不是夸张，这的真的是绝对安静，雪层把所有声音都吸收了。",
      "center_point": [12, 20],
      "sub_nodes": {}
    },
    "Zero_Halo_Moat": {
      "visual_texture": "围绕着Z区悬浮中心且完美正圆的人工护城河。水体极其洁净，并没有漂浮物，像一面镜子一样倒映着上方的白色高令塔。水下安装了大量甚至不仅是发蓝光而是不同功能指示灯的净化设备，即便在夜晚，水面也隐约发亮。",
      "sensory_feed": "与其说是自然的水声，不如说是听轻音乐。水流被控制得非常平缓，连波纹都是规律的。这里没有鱼腥味，只是一股加湿器喷出的纯净水汽味道。靠近它会让人不自觉地安静下来。",
      "center_point": [-6, -6],
      "sub_nodes": {}
    },
    "Mirror_Lotis_Lake": {
      "visual_texture": "位于岛屿内陆中央、深根空洞上方的镜面莲花湖 (Mirror Lotis Lake)。湖面宽阔平静，覆盖着半透明发光的巨大莲叶，即便一个成年人站上去也不会沉。湖水带有微妙的虹彩光泽，周围总是笼罩着不散的薄雾。",
      "sensory_feed": "充满了灵性的氛围，耳边回荡着轻灵的水滴声。湿度极大，靠近湖边皮肤会瞬间觉得湿润。这里的时间流感似乎变慢了，气味是一股像是甜睡莲般的幽香，让人非常放松，但也有些不仅容易甚至很可能不仅在不知不觉中迷路的迷离感。",
      "center_point": [-10, -11],
      "sub_nodes": {}
    },
    "Emerald_Vein_River": {
      "visual_texture": "这是贯穿B区的主动脉翡翠脉络河 (Emerald Vein River)。河水并不是透明的无色，而是因为富含矿物质呈现出充满生机的翠绿色。两岸不仅植被茂密，还有大量深入河道的树根。在阳光下，整条河就像是一条流动着的绿色绸带。",
      "sensory_feed": "充满活力的自然噪声。水流很快，撞击岩石和树根会发出哗啦啦的响声。即使不靠近也能感觉到扑面而来的水雾。空气里全是草腥味和新鲜泥土的味道，是很多水栖生物最喜欢的乐园路。",
      "center_point": [-12, -17],
      "sub_nodes": {}
    },
    "Crystal_Lagoon": {
      "visual_texture": "位于入海口的晶体泻湖 (Crystal Lagoon)，不仅连接着海洋也连接着黄金地平线的西部。水下生长着成片的像是可以反光的天然发光晶簇，导致水面在白天也泛着不自然的亮蓝色。海水浅而透彻，沙底是雪白色的。",
      "sensory_feed": "不仅是不仅是美得不真实，甚至有些魔幻。即便是大浪打过来，经过晶簇折射后也像是碎裂的光斑。空气不是咸的，而是有一种类似薄荷的清凉感。虽然是热带海边，但这里甚至会比普通沙滩凉快很多，适合太阳珊瑚生存。",
      "center_point": [-16, -23],
      "sub_nodes": {}
    },
    "Twin_Destiny_Basin": {
      "visual_texture": "位于Z区后方的巨大分水岭与双命定盆地 (Twin Destiny Basin)。这里是人工护城河与自然水脉暴力的交汇点，巨大的分流闸门如同神殿般耸立在水中。水面在此像是一个被劈开的漩涡，一边是有序的平静（向西），一边是湍急的奔流（向北）。",
      "sensory_feed": "声音非常嘈杂震撼，闸门开启时的轰鸣声如同雷声。站在岸边能感觉到脚下大地的轻微震动。这里风向混乱，时而寒冷（来自北方），时而干燥热风（来自西方），让人从体感上感知到这是两个世界的岔路口。",
      "center_point": [7, 6],
      "sub_nodes": {}
    },
    "Chrome_Canal": {
      "visual_texture": "将S区（暗影区）与N区（霓虹区）强行切割开的笔直人工铬色运河 (Chrome Canal)。两岸不是泥土，而是被钢铁护墙和灯带束缚。水体并非清澈，呈现出独特的如镜面金属般的深银灰色，在城市霓虹的倒影下显得像是一条流动的灯管。",
      "sensory_feed": "虽然是水，却给人干燥、生硬的感觉。完全闻不到自然水体的味道，只有机油味。这里没有青蛙或昆虫的叫声，只有偶尔货船通过的低沉汽笛回音。",
      "center_point": [15, 2],
      "sub_nodes": {}
    },
    "Ferro_Straits": {
      "visual_texture": "N区东部的入海口、钢铁海峡 (Ferro Straits)。这里海况不仅复杂且水深危险。巨大的跨海或者说是跨光辉平原大桥的桥墩和防波堤插入水中。水下隐约可见被废弃沉没的古代金属结构，海面呈现深蓝色，经常卷起白头浪。",
      "sensory_feed": "风声鹤唳，不仅是物理上的海风尖啸，还有桥上高速列车通过的不仅是风噪。这里的海水很冷，即使站在岸上也能感觉到那种刺骨的咸湿。是巨牙鲨等凶猛海兽的出没地，给人充满甚至有点压抑的压迫感。",
      "center_point": [23, 1],
      "sub_nodes": {}
    },
    "Mercury_Stream": {
      "visual_texture": "一路向北穿越工业荒原的水银溪 (Mercury Stream)。虽然名字叫水银，并非真的金属，而是因为携带大量上游如余烬荒原冲刷下来的矿物粉末，水色显得浑浊且厚重，像是灰白色的泥浆。河流在乱石间穿行，河床已被常年冲刷成暗色。",
      "sensory_feed": "水流声沉闷，不同于清水溪流的清脆。因为连通着最北部的冻土，如果你甚至敢把手伸进去，会发现这看似流动的水其实温度极低，接近冰点。",
      "center_point": [12, 14],
      "sub_nodes": {}
    },
    "Frigid_Floe": {
      "visual_texture": "位于岛屿正北极点沿岸、完全结冻的寒冷浮冰 (Frigid Floe)。大部分水面已经被厚实的冰盖封锁，只能从破碎的裂缝中看到下面深黑色的海水。巨大的不规则冰山漂浮在更远的出海口，在极光下反射着苍白的光。",
      "sensory_feed": "这不仅是极寒，更是一种物理上的痛感。寒风如刀子般在冰面上滑过发出呜呜声。四周不仅安静，偶尔传来的冰层碎裂爆响声会在空旷的海面上不仅回荡。这里空气纯净得过分，每一口呼吸都像是在喝冰水。",
      "center_point": [1, 25],
      "sub_nodes": {}
    },
    "Mist_Veil_Sound": {
      "visual_texture": "S区东北海岸线外的海湾，甚至即使是晴天也常年笼罩在著名的雾幕海湾 (Mist Veil Sound) 中。海面通常是一片看不太真切的灰白色，偶尔有露出海面的黑色礁石。因为能见度极低，连远处的灯塔光在雾里都会散成巨大的光晕。",
      "sensory_feed": "湿度极大，不像是海边更像是桑拿房，但气温很低。这里的声音都被大雾吞噬了，非常安静。偶尔会听到远处甚至分不清是船只还是幽灵系宝可梦发出的不仅空灵的鸣叫。这是一种不仅安全而是未知的神秘感。",
      "center_point": [23, 14],
      "sub_nodes": {}
    },
    "Prism_Bay": {
      "visual_texture": "顺接光辉平原与黄金地平线的N区标志性海域棱镜海湾 (Prism Bay)。因其特殊的洋流和折射，水面并不像普通大海那样单调，而是在阳光或霓虹映射下呈现多彩的色带。海面异常宽阔平静，是极巨化游轮和货轮的繁忙主航道。",
      "sensory_feed": "这里就像是一场没完没了的海上节日派对。耳边总是充斥着热闹的不仅是气笛声，甚至还有远处N区传来的电子音乐。空气是热的、咸的，且带着像是防晒油或苏打水的味道。让人觉得充满活力，毫无阴霾。",
      "center_point": [22, -23],
      "sub_nodes": {}
    },
    "Cerulean_Reef": {
      "visual_texture": "位于B区北部与A区南部交界处的蔚蓝珊瑚海 (Cerulean Reef)。这里水不仅没有受到A区火山灰影响，反而是一片极纯的浅蓝绿色。水下密布着因为与火系地形毗邻反而甚至生长茂盛的暖水珊瑚群，能清晰地看到像云朵一样漂浮的巨翅飞鱼群阴影。",
      "sensory_feed": "非常纯粹的自然感。海水平缓，没有大浪，拍打在浅礁上有悦耳的碎裂声。空气里没有沙尘更没有工业废气，是整个西海岸最“干净”的味道。因为水温极其温暖，总是让人有想跳下去游泳的冲动。",
      "center_point": [-23, -5],
      "sub_nodes": {}
    },
    "Basalt_Shoals": {
      "visual_texture": "统治整个A区西部海岸线、险峻的玄武岩浅滩 (Basalt Shoals)。这不是供人行走的滩涂，而是由无数冷却后的六棱柱状玄武岩柱构成的黑色岩石林。海浪在这里不是冲上来，而是直接撞碎在岩壁上，卷起含有大量泡沫的灰色巨浪。",
      "sensory_feed": "充满了力量与危险的气息。海浪撞击岩石的声音有时甚至像雷声。虽然在海边，但空气中充满了烧焦的石头味和硫磺味。这里的风很大且不规律，站在这里感觉随时会被大自然推下去，体感非常粗暴。",
      "center_point": [-23, 14],
      "sub_nodes": {}
    },
    "Equatorial_Dark_Zone": {
      "visual_texture": "位于整个正南方的边界线之外的赤道暗区 (Equatorial Dark Zone)。这是真正的无底深蓝，水色深沉到接近黑色。海平线不仅笔直还异常的低，给人这里水深数万米的直观恐惧感。即使是正午，阳光仿佛也无法穿透表面三米以下。",
      "sensory_feed": "海风静得可怕，这里没有近海的喧嚣。偶尔能看到巨大得不合理的海洋生物阴影从船下掠过。当你注视水面时，会有一种被称为深海恐惧症的吸入感，仿佛海底有什么巨眼在几千米下注视着你。",
      "center_point": [1, -26],
      "sub_nodes": {}
    },
    "Titan_Trough": {
      "visual_texture": "西部的尽头泰坦海槽 (Titan Trough)。这并非平静的宽阔洋面，海面常年波涛汹涌，布满巨大的漩涡。因为连接着活跃的海底火山带（与从炼狱火山口延伸下来的地脉相连），不仅水温异常不均，甚至夜晚偶有时能看到深红色的海底喷发亮光染红海面。",
      "sensory_feed": "充满了暴力的自然能量。海风带着明显的热量和咸味。船只在这里甚至会感到颠簸。如果你贴近水面，甚至能感到微弱的震动，就像是巨人在海底翻身。这里是盖欧卡这类超古代宝可梦可能沉睡的场所。",
      "center_point": [-26, 1],
      "sub_nodes": {}
    },
    "Chrome_Abyss": {
      "visual_texture": "东部的边界铬色深渊 (Chrome Abyss)。这里与其说是海，不如说是不仅金属还有矿物质含量极高的饱和溶液区。水面在特定的角度下甚至会像金属镜面一样反光，却不透明。这片海域没有任何植物漂浮，极其肃杀干净。",
      "sensory_feed": "冷且重劲。海浪拍打船身甚至有金石之声。这里完全没有鱼引发的涟漪，死板得像一大块晃动的水银。空气里有一股导电的铁锈味，水下的磁场极强，指南针常常会在这里剧烈旋转失灵。",
      "center_point": [26, 1],
      "sub_nodes": {}
    },
    "Boreal_Trench": {
      "visual_texture": "封锁着所有极北方向的北境海沟 (Boreal Trench)。海面上漂浮着比其他地方甚至更大的淡蓝色冰山，被称为“白色舰队”。即使看不到海底，那渗透上来的寒气也会让海面常年笼罩在贴近水面的冻雾中。是极光的最佳观测点。",
      "sensory_feed": "这里安静得甚至有些神圣。你可以听到远处冰山互相挤压发出的令人牙酸的“隆隆”声，或是如雷暴般的冰崩声。这里不仅仅是冷，更是一种时间的停滞感。落入水中的不管是人还是温血动物，感觉会被哪怕一秒钟内冻结。",
      "center_point": [1, 26],
      "sub_nodes": {}
    }
  },
"service": {
  "Wares_General": {
    "name": "General PkMarts",
    "desc": "几乎每个主要路口都能见到的蓝顶小报刊亭或便利店，拥有显眼的“P!”蓝色标志。这里不仅24小时营业，还提供所有标准型号的精灵球、基础伤药和简单的旅行零食。自助结账，非常方便，是旅行者的标准补给站。"
  },
  "Shop_Special_Z": {
    "name": "Crown Boutique (Z)",
    "desc": "Z区限定的皇冠高端精品店。装修采用白金极简风格，店员统一戴着白手套。陈列的都是最高级的商品：豪华球、高级回复药、增强剂（攻击/防御增强）以及定制的时装礼服。这里讲究预约制，没有喧闹的促销海报，只有淡淡的熏香味和高昂的价格签。"
  },
  "Shop_Special_N": {
    "name": "Silph-Devon Tech (N)",
    "desc": "N区限定的得文电子专卖店。店内非常赛博朋克风，商品被陈列在悬浮磁力架上，甚至地板都是屏幕。主要售卖全套技能机器（TM）、各类提升属性的携带道具（如讲究眼镜）和洛托姆机型装饰换壳。这里背景音乐节奏很快，到处都是拿着平板比价的硬核玩家。"
  },
  "Shop_Special_B": {
    "name": "Aroma Herbalist (B)",
    "desc": "B区限定的自然香薰小筑与疗愈屋。通常是建在木质平台上的半露天凉棚，挂满了风干的草药束。这里提供不仅是树果（包括比较稀有的减少努力值树果），还有独家配方的中草药（复活草/元气粉）和用大锅（Moomoo Milk）制成的各色饮料。味道很苦但非常治愈。"
  },
  "Shop_Special_S": {
    "name": "Underground Market (S)",
    "desc": "S区限定的地下黑市与旧货铺。通常隐藏在小巷深处，或是没有招牌的铁皮门后。店里光线昏暗，甚至堆放混乱。这里能淘到奇怪的进化道具（比如灵界之布、诅咒之符）、各类古代风格的精灵球（如沉重球），甚至来路不明的贵重品。店主通常话很少，支持以物易物。"
  },
  "Shop_Special_A": {
    "name": "Apex Supply Depot (A)",
    "desc": "A区限定的工区装备站与军需点。外观用防爆钢板加固过，门口甚至能停放大卡车。主要售卖专为长时间野外和矿区作业准备的高强度物资：全满药、甚至更强效的离洞绳、各类增强岩石/地面/钢系技能的护具（如硬石头、金属膜）。一切都是为了实用，包装都是非常直男的重工业风。"
  },
  "Shop_Ginkgo_Cart": {
    "name": "Ginkgo Guild Cart",
    "desc": "流动的特殊商铺。不是固定的店面，而是一个背着巨大蓝色背包、拉着木制篷车的神秘行脚商（银杏商会成员）。他会不知从何处出现，又随后消失。卖的东西完全随机：可能是另一个地区的特产洗翠精灵球、进化石，或者是极其罕见的腐朽之剑等传说道具。遇到他就代表运气极好。"
  },
  "CP_Zenith_Main": {
    "name": "Central Plaza PC",
    "desc": "特区的总院。并非传统的红顶建筑，而是一座挑高巨大的白色拱顶建筑，外墙悬挂著巨大的动态光环LOGO。内部空间极其宽敞，地板一尘不染甚至能反光。这里不仅没有排队，甚至配备了最顶尖的吉利蛋特护团队，所有的治疗机都是静音的悬浮型号，充满了未来医疗的精英感。"
  },
  "CP_Neon_Central": {
    "name": "Neon Stream PC",
    "desc": "嵌在商业大楼底层中的繁忙站点。门口的PNC标志是霓虹灯管做的，全天闪烁。虽然内部拥有最快的全自动恢复台和自助PC柜机，但因为地处市中心，大厅在任何时候都挤满了拿着手机交换情报的训练家。为了适应城市节奏，这里还兼做24小时网络咖啡厅，提供甚至比其他地方更贵的能量饮料。"
  },
  "CP_Bloom_Port": {
    "name": "Seaside Resort PC",
    "desc": "一座建在海边木栈台上的半开放式木屋，屋顶覆盖着真实的棕榈叶。与其说是医院，不如说是度假村的前台。内部没有空调，全是自然的海风，乔伊小姐甚至穿着休闲风格的夏威夷衬衫。等待区是舒服的吊床和藤椅，并免费提供椰子水。"
  },
  "CP_Shadow_Slum": {
    "name": "Iron-Soot Relief PC",
    "desc": "由几个加固过的标准集装箱拼接而成的服务点，外墙喷着略显陈旧的红白色油漆。为了节能，灯光开得比较暗，室内通过老式暖气供暖。虽然设备是上几代的型号，启动时有轻微噪音，但保养得非常好。角落里总是坐满了来这里避寒取暖的当地老人或体力劳动者。"
  },
  "CP_Apex_Base": {
    "name": "Frontier Outpost PC",
    "desc": "完全按照战地堡垒标准修建的前线治疗站。没有华丽的落地窗，只有厚重的防爆墙。治疗区域甚至和停车场相连，方便受伤的大岩蛇等巨型宝可梦直接进入。乔伊小姐穿着耐磨的工装夹克而不是护士裙。空气里有一股不仅有消毒水，还有机油和红土混杂的硬朗味道。"
  },
  "Bed_Rest": {
    "name": "Standard Lodging",
    "desc": "标准化的酒店、旅馆或民宿房间，提供干净的床铺和基础卫浴，是恢复体力和调整队伍状态的安全休息点。"
  },
  "Player_s_Room": {
    "name": "Personal Quarters",
    "desc": "属于主角的私人空间（位于Z区员工宿舍内）。虽然不大，但这有你的私人仓库终端和还没玩完的游戏机。"
  },
  "PC_Terminal": {
    "name": "Box-Link Terminal",
    "desc": "连接西尔佛云端存储系统的物理终端。不仅仅是一台电脑，它通常更像是一个带有高功率天线的信号基站。只要在这个终端的信号覆盖范围内，就可以甚至无接触地进行宝可梦的大规模传送与存取。"
  },
  "Police_Box_Z": {
    "name": "Z-Sec Station",
    "desc": "完全不像警察局的安保中心。采用白色流线型外观，门口停着悬浮警用摩托。这里更像是信息验证服务站，不仅没有铁栏杆，警员也穿着整洁的礼兵制服，主要处理证件丢失或反重力通道的权限纠纷。"
  },
  "Police_Box_N": {
    "name": "N-City Patrol Box",
    "desc": "设在繁华商区转角的双层岗亭，头顶的警灯和周围的霓虹招牌一样昼夜闪烁。配备了高速数据终端，以便快速处理网络诈骗或非法无人机干扰。门口常驻着一只雷电兽，警员显得十分忙碌，经常有人来问路或报案钱包也是常态。"
  },
  "Police_Box_B": {
    "name": "Coast Guard Hut",
    "desc": "从外观上看像是一座带有红色警灯的瞭望塔或救生员站。建在视野开阔的木栈道旁，不仅负责治安，更负责气象预警和海上救援。门口停着快艇或拉普拉斯，这里的警员也是潜水好手。"
  },
  "Police_Box_S": {
    "name": "S-District Post",
    "desc": "设立在街区入口的混凝土碉堡式岗亭，也是窗户上装有防护铁网。相比别的区域，这里更具警戒感，墙上贴满了显眼的通缉令。警员与当地帮派似乎有一种默契，通常不会主动走出岗亭，更多是作为一个最后的仲裁和保护点存在。"
  },
  "Police_Box_A": {
    "name": "Ranger Base Camp",
    "desc": "与其说是警察局，不如说是野外救援基地。建筑结构非常厚实，能够抵御落石和沙暴。门口停着全地形车，并没有普通的警员，而是配有强力宝可梦（如哈约克或波士可多拉）的巡护员，随时准备应对野生宝可梦暴动或矿难事故。"
  },

  "place_anchor": {
    "Cafe": {
      "desc": "进行社交、对话与交换情报的休闲室内场所。"
    },
    "Bar": {
      "desc": "夜间活动的社交据点，适合更私密或成熟的对话与放松。"
    },
    "Diner": {
      "desc": "用餐与恢复精力的公共功能区。"
    },
    "Shop_Browsk": {
      "desc": "进行浏览、购物或检视商品的商业互动节点。"
    },
    "Arcade": {
      "desc": "进行娱乐活动、游戏竞技能或宣泄情绪的喧闹环境。"
    },
    "Relax": {
      "desc": "让角色停止移动、进入待机、休息或进行精神调整的被动区域。"
    },
    "Viewpoint": {
      "desc": "提供视线与观察的高点。角色在此处通常会进行远眺、巡视或发呆行为。"
    },
    "Plaza": {
      "desc": "人流聚集的开放空间，用于群体活动、通行中转或公开展示。"
    },
    "Nature_Spot": {
      "desc": "具有自然属性的静止点。角色在此倾向于与环境互动（如触摸植物、喂食）或是远离人群独处。"
    },
    "Study": {
      "desc": "需要信息获取与专注思考的区域，用于阅读、记录数据或研究。"
    }
  }
},

"system_warps": {
  "Sewer": {
    "desc": "城市地下的排水管网与检修通道。环境阴暗潮湿，回声严重。通常是连接地面与隐蔽区域的特殊捷径，可能有毒系宝可梦出没。"
  },
  "Cave": {
    "desc": "天然形成或人工开凿的岩石洞穴入口。内部光线缺失，地形复杂。往往能通向山的另一侧或地底深处，空气中充满土腥味。"
  },
  "Gate": {
    "desc": "废弃的地铁站点闸口。虽然列车已停运，但在地图中仍作为连接主要城区与老旧地下轨道的关卡。通道通常宽阔且黑暗。"
  }
},
"transit_infrastructure": {
  "Central_Hub": {
    "desc": "位于Z区底部的超级交通枢纽，也是整个特区的心脏。四条主要轨道线在这里垂直交汇。不仅有地铁停靠站，也是通往上层浮空岛的反重力电梯中转口。永远人流如织。"
  },
  "Electro_Avenue": {
    "desc": "服务于N区（霓虹城）的站点，出口均直接连接大型商场的内部。与沉闷的传统车站不同，这里站台也挂满的电子广告，背景音乐动感十足，更像是主题乐园的入口。"
  },
  "Seaside_Terminal": {
    "desc": "位于B区海岸线的半露天车站。同时也是不仅陆地列车，也是水上渡轮的换乘点。站台没有封闭的墙壁，海风直接吹进车站，甚至有海鸥停在列车顶棚上。"
  },
  "District_S": {
    "desc": "深埋在S区（暗影区）地下的旧式站台。墙面有着明显的水渍和涂鸦。虽然磁悬浮技术依然在运作，但这里特有的黄色老式灯光照明让它看起来很有年代感，出口大多连接着狭窄的小巷。"
  },
  "Frontier_Outpost": {
    "desc": "位于A区荒野边缘的最前线货运站。为了适应恶劣环境，从外观看更像是个拥有防沙闸门的碉堡。这里停靠的更多是满载矿石的重型黑色货列，也是探险家深入火山前的最后一个补给点。"
  },
  "Neon_Cargo_Terminal": {
    "desc": "N区外海的大型货运码头区。主要服务于工业物资吞吐，岸边是甚至高过大楼的巨大起重机群。虽然不允许私家船只随意靠近，但定期有运送大宗电子零件的重型船只进出。"
  },
  "Sapphire_Marina": {
    "desc": "B区的民用观光码头。水域较浅且平静，停泊着大量私人的白色游艇和玻璃底观光船。栈桥采用防腐木铺设，不仅是交通点，也是游客喂食水系宝可梦的亲水平台。"
  },
  "Restricted_Dock": {
    "desc": "位于偏远位置的封闭式船坞，通常指代那些不对公众开放的军事或科考泊位。被高墙和铁丝网围起来，偶尔有印着以太基金会或联盟标志的黑色舰艇悄无声息地通过。"
  },
  "Northern_Cemetery_Pad": {
    "desc": "位于霜烟市北部山丘顶端的飞行停机坪。这是通往S区神奥风格公墓最直接的方式。周围常有雾气，负责接送的大多是拥有除雾能力的飞行系宝可梦。"
  },
  "Summit_Dojo_Point": {
    "desc": "位于全岛某个极难攀爬的山巅之上的降落标记点。只有通过空运才能抵达这座隐世的修行道场，风很大，空气稀薄。"
  },
  "Zenith_HQ_Helipad": {
    "desc": "以太乐园总部顶层的豪华起降平台。不仅地面有指示灯，还配有引导系统。这是特区权力的最高点，视野极佳，可以直接俯瞰整个中心Z区。"
  },
  "Lift_Station_Lower": {
    "desc": "位于火山脚下的缆车起部站台，连接着红莲锻造市的平原。机器庞大且充满油污感，巨大的齿轮转动声在山谷回荡。轿厢不仅甚至经常是开放式的金属笼子。"
  },
  "Lift_Station_Upper": {
    "desc": "建在火山口高处断崖边缘的终点站，悬空在一片翻滚的熔岩之上。这里温度极高，空气中漂浮着黑灰。是从平原快速抵达高海拔采矿区和雪线边缘的唯一机械通道。"
  }
},

"npc_actor_context": {
  "Gloria_Camp_Curry": {
    "desc": "位于B区与A区交界处的露天营地。场地中央架设着篝火堆与一口不仅有使用痕迹、且正冒着热气的黑色特大号铁锅。周围摆放着充当座椅的原木树桩和加固过的防风帐篷。地面上整齐堆叠着成箱的树果食材、食用油以及大量不同口味的速食咖喱块。"
  },
  "Rosa_PokeStar_Studios": {
    "desc": "位于辉光市大楼顶层的临时摄影区域。房间四壁贴满了绿幕，角落堆放着还没拆封的巨大机甲道具和特摄片皮套。场地中央架设着电影摄影机、轨道和补光反光板。导演椅旁边的白板上写满了关于N区街头取景的分镜脚本，地面散落着多箱功能饮料。"
  },
  "Dawn_VIP_Beach_Villa_01": {
    "desc": "珍珠镇最前端的独栋白色度假屋。拥有一扇能直接眺望海平线的巨大落地窗。室内为现代简约装修风格。长桌上陈列着专业的波芬搅拌机、宝可梦华丽大赛专用打分表，以及若干个外观精美、收纳着礼服的半透明防尘箱。"
  },
  "Akari_Jubilife_Survey_Barracks": {
    "desc": "位于神阖之空洞（Kamunagi Hollow）边缘的一间半木半石结构的小屋。内部还原了洗翠时期银河队宿舍的布局，地面铺设着粗糙的草席。墙面上挂着一幅用炭笔绘制的羊皮纸地形图。木桌上堆放着大量红球果、黑玉石以及制作手工投掷道具的松脂材料，屋内仅靠旧式炭盆取暖。"
  },
  "Serena_Boutique_Serena_Style": {
    "desc": "位于商业区建筑二楼的独立工作间。与外部零售区隔断，私密性极高。一面巨大的落地穿衣镜占据了整面墙壁。周边的挂衣架上陈列着大量手绘设计稿和仅完成了半成品的样衣。缝纫机旁边的软木板上钉满了关于波伦加杯历代冠军造型的剪报资料。"
  },
  "Selene_Jungle_Treehouse": {
    "desc": "利用Jade Canopy巨树枝丫搭建的悬空平台，未安装墙壁与屋顶。通过一道粗糙的软绳梯连接地面。平台上铺着数张巨大的芭蕉叶作为床铺，四周挂着诸岛巡礼队长的各色信物作为装饰。由于四面又透风，由于直接暴露在森林气候中。"
  },
  "Juliana_Int_l_Dorm_Rm_303": {
    "desc": "一间被彻底改造的学生宿舍单人间。地板被堆积的大量发光物体（彩色玻璃珠、皇冠瓶盖、太晶矿石碎块）完全覆盖。所有的抽屉均处于开启状态，塞满零食包装袋。墙面贴着一张画满红圈的特区手绘地图，床铺上的被褥呈现未折叠的团状。"
  },
  "May_Secret_Base": {
    "desc": "利用天然岩壁凹陷改造的隐蔽空间，入口处用印有图案的海报板进行了伪装。内部地面铺设着厚实的红色地毯，放置着特大号吼吼鲸玩偶和一座滑梯。里侧的置物架上摆满了大量的布偶玩具、零食存货以及手写的冒险日记。"
  },
  "Iris_Zenith_Air_Attic": {
    "desc": "位于Z区居住区最高层的复式公寓，主立面为全景玻璃幕墙。室内空调温度设定极高，空气干燥暖热。纯白色的现代组合沙发被推挤在房间中央位置，长毛地毯上混杂堆积着厚绒毯、未吃完的树果拼盘以及散落的手持游戏机。"
  },
  "Nemona_Suite": {
    "desc": "位于皇家学院精英宿舍楼名为“葡萄栋”的高层套房。保持着学院标准的白色极简装潢，只是书架上几乎没有教科书，全部塞满了个体值计算器和对战录像带。墙面上挂着一块巨大的白板，上面用马克笔画满了杂乱的对战路线图。书桌被当成了临时工作台，堆放着各种款式的手机洛托姆外壳和大量未开封的伤药箱。"
  },
  "Cynthia_Study_Room": {
    "desc": "位于行政主塔高层的独立研究办公室。这间原本拥有无菌感的宽敞白色房间，目前大部分地面面积被堆叠的实物资料占据。全息投影桌上混合摆放着古代石碑的石墨拓印、出土的陶器碎片以及厚重的纸质古籍。室内空气维持在较低温度，桌角通常放着已经打开的冰淇淋纸桶"
  },
  "Lusamine_Exec_Private_Penthouse": {
    "desc": "位于Z区行政塔顶端的独立平层公馆。四面均为全景落地玻璃，俯瞰特区全貌。室内以白色与金色的流线型家私为主，中央放置着连通特区监控系统的控制台，两侧设有展示珍稀被子植物的恒温玻璃柜。"
  },
  "Lillie_Staff_Dormitory_Room_201": {
    "desc": "位于以太分部职工宿舍区的标准单人间。房间布局十分规整，没有多余的装饰。书桌上整齐摆放着几本基础训练家入门教材和宝可梦护理手册，床头柜上放着一套未拆封的高级护肤礼盒。"
  },
  "Mallow_Lana_Alola_Breeze_Diner_Room": {
    "desc": "位于B区滨海栈桥上的半开放式木造建筑，入口处挂着写有“阿罗拉之风”的醒目招牌。前厅区域设有料理柜台与客座，空气中弥漫着香料气味；内部后厨通过屏风分隔，直接连通着摆放有吊床、钓具与日常起居用品的员工休息空间。"
  },
  "Irida_Pearl_Clan_Sanctuary": {
    "desc": "搭建在神阖谷S区一侧的圆顶帐篷建筑。内部四壁悬挂着印有珍珠队徽章的粉紫色挂毯，地面铺设有隔绝地气的厚绒地毯。虽装饰复古，但房间中央正运转着一台与环境格格不入的现代大功率移动空调。"
  },
  "Misty_Lifeguard_Tower": {
    "desc": "矗立在B区高难度水域边的高架瞭望台。内部空间狭窄，仅包含一把高脚观测椅和简单的急救柜。墙上挂着当日的风浪等级表，角落里倚靠着一块红色的专业救援浮板。"
  },
  "Lacey_Committee_Office": {
    "desc": "位于Z区学院西苑的独立办公套间。外间是处理日常事务的会客办公区，桌面整洁，摆放着常用的文件与一套待客用的茶具。内侧直接连通着她的私人寝室，是一个保持着极高整洁度的标准女生房间，陈列着粉色系的床铺以及柔软的毛绒地毯，没有任何乱扔的杂物。"
  },
  "Sonia_Rhodia_Central_Lab": {
    "desc": "位于技术中心一层宽敞的环形研究大厅。室内采用了标准的白色实验室装潢，四周墙壁贴满了记录版和高耸的书架。房间中央设有一台正在运行的大型多面体数据解析装置。中心工位周围堆积着大量散乱的纸质报告、外卖包装盒以及带有咖啡渍的马克杯，甚至挡住了通往休息折叠床的过道。"
  },
  "Roxie_Venom_Core_Live_House": {
    "desc": "位于N区地下的演出场地。四周墙壁覆盖着厚重的波浪形隔音棉，表面贴满了重叠的乐队贴纸。低矮的舞台上架设着整套架子鼓与巨大的低音贝斯音响墙。地板上有明显的磨损痕迹和固定线缆的胶带残留，空气中残留着舞台烟雾机特有的气味。"
  },
  "Iono_Levincia_Guild_Tower": {
    "desc": "位于N区广播塔高层的复合空间。外部是布满绿幕即环形补光灯的专业直播间，设备极其高端。通过一道隔音门连接着内部的一间私密起居室，那里堆积着大量零食、掌机和线缆，中央摆放着甚至不需要下地就能操作电脑的懒人电竞床舱，生活气息非常宅态。"
  },
  "Marnie_Spikemuth_Relief_Center": {
    "desc": "位于S区旧街深处、利用废弃LiveHouse门厅改造的堂口式据点。照明以暗紫色的霓虹灯管为主，混凝土墙壁上喷满了呐喊队（Team Yell）的不仅是涂鸦还有应援海报。前厅用铁丝网和音响箱堆出了一个物资分发柜台。穿过厚重的黑色绒布帘则是玛俐的私人起居室，空间虽然不大，但布置着哥特风格的蕾丝床铺和专业化妆镜，书桌上不仅有变装用的演出服，还压着计算赤字用的账本。"
  },
  "Hex_Curio_Shop_Seance": {
    "desc": "位于S区偏僻巷角的一间古董杂货铺。店内几乎没有自然采光，照明仅靠几盏昏暗的烛台。狭窄的货架延伸至天花板，密密麻麻地挤满了落灰的旧式瓷娃娃、带有缺口的古代面具以及贴着封条的陶罐，空气不流通且弥漫着浓重的线香气味。"
  },
  "Bea_Iron_Will_Dojo": {
    "desc": "位于A区的一座封闭式格斗道场。室内空间极为空旷，除了大面积铺设的实木地板外，没有任何装饰性家具。场地四周设有不同重量级的悬挂式沙袋和带有明显打击凹痕的木人桩。角落的架子上整齐叠放着大量纯白色的素面毛巾与备用的道带。"
  },
  "Erika_Celadon_Spa": {
    "desc": "位于B区花田深处的独立日式木造庭院。主建筑为“回”字形结构，通过纸门分隔出多间充满草药蒸汽的芳疗室。庭院后的内室是莉佳即用作问诊也用作起居的私人茶室，铺设着传统的榻榻米，壁龛上插着当季的花卉，角落里叠放着用于休息的软垫被褥，环境极其安静"
  },
  "Nessa_The_Infinity_Poolside_Lounge": {
    "desc": "位于B区海岸线高处、与私人无边泳池无缝连接的VIP玻璃幕墙休息厅。室内常年保持恒温除湿，视野直面开阔海景。中央摆放着极简风格的防水家具和巨大的电子战术分析板。休息厅内侧设有一间没有窗户、仅用来深度睡眠的隔音单间，堆放着大量备用的大浴巾和潜水装备。"
  },
  "Acerola_Abandoned_Library": {
    "desc": "位于S区边缘的一座石砌老式建筑内部。几排与天花板齐高的书架摇摇欲坠，塞满了未分类的陈旧古籍。原有的阅览桌被移开，房间中央的地板上堆积着像山一样的宝可梦布偶和破旧靠垫，构成了一个看起来像巨大猫窝的睡眠区，照明仅靠漂浮的鬼火。"
  },
  "Skyla_Hangar_04": {
    "desc": "位于A区荒原机场侧面的4号抗风机库。巨大的卷帘门通常敞开，停泊着一架正在维护的红色重型货运飞机。地面散落着各种型号的扳手和油桶。机库上层搭建了一个简易的金属阁楼作为生活区，护栏上挂着许多用于测定风向的彩色风筒和飞行夹克。"
  }
}
}